CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_fmc.h
/* FMC_KEY0 */
#define FMC_KEY0_KEY                 BITS(0,31)                                         /*!< flash bank0 unlock key bits */

/* FMC_STAT0 */
#define FMC_STAT0_BUSY               BIT(0)                                             /*!< flash bank0 busy flag */
#define FMC_STAT0_PGSERR             BIT(1)                                             /*!< flash bank0 program sequence error flag */
#define FMC_STAT0_PGERR              BIT(2)                                             /*!< flash bank0 program error flag */
#define FMC_STAT0_PGAERR             BIT(3)                                             /*!< flash bank0 program alignment error flag */
#define FMC_STAT0_WPERR              BIT(4)                                             /*!< flash bank0 erase/program protection error flag */
#define FMC_STAT0_ENDF               BIT(5)                                             /*!< flash bank0 end of operation flag */
#define FMC_STAT0_CBCMDERR           BIT(6)                                             /*!< flash bank0 checked area by the check blank command is all 0xFF or not */
#define FMC_STAT0_RSTERR             BIT(15)                                            /*!< flash bank0 BOR/POR or system reset during erase/program flag */

/* FMC_CTL0 */
#define FMC_CTL0_PG                  BIT(0)                                             /*!< flash bank0 program command bit */
#define FMC_CTL0_PER                 BIT(1)                                             /*!< flash bank0 page erase bit */
#define FMC_CTL0_MER                 BIT(2)                                             /*!< flash bank0 mass erase bit */
#define FMC_CTL0_START               BIT(6)                                             /*!< send erase command to flash bank0 bit */
#define FMC_CTL0_LK                  BIT(7)                                             /*!< flash bank0 lock bit */
#define FMC_CTL0_FSTPG               BIT(8)                                             /*!< flash bank0 fast program command bit */
#define FMC_CTL0_ERRIE               BIT(10)                                            /*!< flash bank0 error interrupt enable bit */
#define FMC_CTL0_ENDIE               BIT(12)                                            /*!< flash bank0 end of operation interrupt enable bit */
#define FMC_CTL0_CBCMD               BIT(16)                                            /*!< send check blank command to flash bank0 bit */
#define FMC_CTL0_CBCMDLEN            BITS(29,31)                                        /*!< check blank command read length to flash bank0 */

/* FMC_ADDR0 */
#define FMC_ADDR0_ADDR               BITS(0,31)                                         /*!< flash bank0 command address bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY              BITS(0,31)                                         /*!< option bytes unlock key bits */

/* FMC_KEY1 */
#define FMC_KEY1_KEY                 BITS(0,31)                                         /*!< flash bank1 unlock key bits */

/* FMC_STAT1 */
#define FMC_STAT1_BUSY               BIT(0)                                             /*!< flash bank1 busy flag */
#define FMC_STAT1_PGSERR             BIT(1)                                             /*!< flash bank1 program sequence error flag */
#define FMC_STAT1_PGERR              BIT(2)                                             /*!< flash bank1 program error flag */
#define FMC_STAT1_PGAERR             BIT(3)                                             /*!< flash bank1 program alignment error flag */
#define FMC_STAT1_WPERR              BIT(4)                                             /*!< flash bank1 erase/program protection error flag */
#define FMC_STAT1_ENDF               BIT(5)                                             /*!< flash bank1 end of operation flag */
#define FMC_STAT1_CBCMDERR           BIT(6)                                             /*!< flash bank1 checked area by the check blank command is all 0xFF or not */
#define FMC_STAT1_RSTERR             BIT(15)                                            /*!< flash bank1 BOR/POR or system reset during erase/program flag */

/* FMC_CTL1 */
#define FMC_CTL1_PG                  BIT(0)                                             /*!< flash bank1 program command bit */
#define FMC_CTL1_PER                 BIT(1)                                             /*!< flash bank1 page erase bit */
#define FMC_CTL1_MER                 BIT(2)                                             /*!< flash bank1 mass erase bit */
#define FMC_CTL1_MERDF               BIT(3)                                             /*!< data flash mass erase bit */
#define FMC_CTL1_OB0PG               BIT(4)                                             /*!< option bytes 0 program command bit */
#define FMC_CTL1_OB0ER               BIT(5)                                             /*!< option bytes 0 erase command bit */
#define FMC_CTL1_START               BIT(6)                                             /*!< send erase command to FMC bit */
#define FMC_CTL1_LK                  BIT(7)                                             /*!< flash bank1 lock bit */
#define FMC_CTL1_FSTPG               BIT(8)                                             /*!< fast program command bit */
#define FMC_CTL1_OBWEN               BIT(9)                                             /*!< option bytes erase/program enable bit */
#define FMC_CTL1_ERRIE               BIT(10)                                            /*!< flash bank1 error interrupt enable bit */
#define FMC_CTL1_ENDIE               BIT(12)                                            /*!< flash bank1 end of operation interrupt enable bit */
#define FMC_CTL1_OBRLD               BIT(13)                                            /*!< option bytes reload bit */
#define FMC_CTL1_CBCMD               BIT(16)                                            /*!< send check blank command to flash bank1 bit */
#define FMC_CTL1_SRAMCMD             BITS(24,25)                                        /*!< send shared SRAM command */
#define FMC_CTL1_CBCMDLEN            BITS(29,31)                                        /*!< check blank command read length to flash bank1 */

/* FMC_ADDR1 */
#define FMC_ADDR1_ADDR               BITS(0,31)                                         /*!< flash bank1 command address bits */

/* FMC_OBSTAT */
#define FMC_OBSTAT_OBERR             BIT(0)                                             /*!< option bytes read error bit */
#define FMC_OBSTAT_PLEVEL            BITS(1,2)                                          /*!< protection level bits */
#define FMC_OBSTAT_USER              BITS(8,15)                                         /*!< option bytes user bits */
#define FMC_OBSTAT_DATA              BITS(16,31)                                        /*!< option bytes data bits */

/* FMC_WP0 */
#define FMC_WP0_BK0WP                BITS(0,31)                                         /*!< store OB_BK0WP[31:0] of option bytes 0 block after system reset */

/* FMC_WP1 */
#define FMC_WP1_BK1WP                BITS(0,7)                                          /*!< store OB_BK1WP[7:0] of option bytes 0 block after system reset */
#define FMC_WP1_DFWP                 BITS(8,15)                                         /*!< store OB_DFWP[7:0] of option bytes 0 block after system reset */

/* FMC_OB1CS */
#define FMC_OB1CS_OB1ERR             BIT(0)                                             /*!< option bytes 1 read error bit */
#define FMC_OB1CS_OB1START           BIT(1)                                             /*!< send option bytes 1 change command to FMC */
#define FMC_OB1CS_OB1LK              BIT(2)                                             /*!< option bytes 1 lock bit */
#define FMC_OB1CS_EFALC              BITS(4,7)                                          /*!< load EFALC of option bytes 1 after reset */
#define FMC_OB1CS_EPSIZE             BITS(8,11)                                         /*!< load EPSIZE of option bytes 1 after reset */
#define FMC_OB1CS_EPLOAD             BIT(15)                                            /*!< load EPLOAD of option bytes 1 after reset */
#define FMC_OB1CS_LKVAL              BITS(16,31)                                        /*!< load LKVAL of option bytes 1 after reset */

/* FMC_PID */
#define FMC_PID_PID                  BITS(0,31)                                         /*!< product ID bits */

/* constants definitions */
/* fmc state */
typedef enum {
    FMC_READY = 0U,                                                                     /*!< the operation has been completed */
    FMC_BUSY,                                                                           /*!< the operation is in progress */
    FMC_PGSERR,                                                                         /*!< program sequence error */
    FMC_PGERR,                                                                          /*!< program error */
    FMC_PGAERR,                                                                         /*!< program alignment error */
    FMC_WPERR,                                                                          /*!< erase/program protection error */
    FMC_TOERR,                                                                          /*!< timeout error */
    FMC_CBCMDERR,                                                                       /*!< the checked area not blank error */
    FMC_RSTERR,                                                                         /*!< BOR/POR or system reset during flash erase/program error */
    FMC_OB_HSPC,                                                                        /*!< FMC is under high security protection */
    FMC_OB1_LK                                                                          /*!< option bytes 1 is locked */
} fmc_state_enum;

/* shared SRAM mode */
typedef enum {
    NO_SRAM_MODE = 0U,                                                                  /*!< SRAM mode is not configured */
    FASTPG_SRAM_MODE,                                                                   /*!< fast program SRAM mode */
    BASIC_SRAM_MODE                                                                     /*!< basic SRAM mode */
} fmc_sram_mode_enum;

/* FMC area */
typedef enum {
    BANK0_AREA = 0U,                                                                    /*!< main flash bank0 area */
    BANK1_AREA,                                                                         /*!< main flash bank1 area */
    DATA_FLASH_AREA                                                                     /*!< data flash area */
} fmc_area_enum;

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)             (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define FMC_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define FMC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                            | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define FMC_REG_VAL2(offset)            (REG32(FMC + ((uint32_t)(offset) >> 22)))
#define FMC_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define FMC_STAT0_REG_OFFSET            ((uint32_t)0x0000000CU)                         /*!< STAT0 register offset */
#define FMC_STAT1_REG_OFFSET            ((uint32_t)0x0000004CU)                         /*!< STAT1 register offset */
#define FMC_ECCCS_REG_OFFSET            ((uint32_t)0x00000004U)                         /*!< ECCCS register offset */
#define FMC_OB1CS_REG_OFFSET            ((uint32_t)0x00000068U)                         /*!< OB1CS register offset */
#define FMC_CTL0_REG_OFFSET             ((uint32_t)0x00000010U)                         /*!< CTL0 register offset */
#define FMC_CTL1_REG_OFFSET             ((uint32_t)0x00000050U)                         /*!< CTL1 register offset */
#define FMC_OBSTAT_REG_OFFSET           ((uint32_t)0x0000005CU)                         /*!< OBSTAT register offset */

/* FMC flags */
typedef enum {
    /* flags in STAT0 register */
    FMC_BANK0_FLAG_BUSY = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 0U),                     /*!< flash bank0 busy flag */
    FMC_BANK0_FLAG_PGSERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 1U),                   /*!< flash bank0 program sequence error flag */
    FMC_BANK0_FLAG_PGERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 2U),                    /*!< flash bank0 program error flag */
    FMC_BANK0_FLAG_PGAERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 3U),                   /*!< flash bank0 program alignment error flag */
    FMC_BANK0_FLAG_WPERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 4U),                    /*!< flash bank0 erase/program protection error flag */
    FMC_BANK0_FLAG_END = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 5U),                      /*!< flash bank0 end of operation flag */
    FMC_BANK0_FLAG_CBCMDERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 6U),                 /*!< flash bank0 checked area by the check blank command is all 0xFF or not flag */
    FMC_BANK0_FLAG_RSTERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 15U),                  /*!< flash bank0 BOR/POR or system reset during erase/program flag */
    /* flags in STAT1 register */
    FMC_BANK1_FLAG_BUSY = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 0U),                     /*!< flash bank1 busy flag */
    FMC_BANK1_FLAG_PGSERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 1U),                   /*!< flash bank1 program sequence error flag */
    FMC_BANK1_FLAG_PGERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 2U),                    /*!< flash bank1 program error flag */
    FMC_BANK1_FLAG_PGAERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 3U),                   /*!< flash bank1 program alignment error flag */
    FMC_BANK1_FLAG_WPERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 4U),                    /*!< flash bank1 erase/program protection error flag */
    FMC_BANK1_FLAG_END = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 5U),                      /*!< flash bank1 end of operation flag */
    FMC_BANK1_FLAG_CBCMDERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 6U),                 /*!< flash bank1 checked area by the check blank command is all 0xFF or not flag */
    FMC_BANK1_FLAG_RSTERR = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 15U),                  /*!< flash bank1 BOR/POR or system reset during erase/program flag */
    /* flags in ECCCS register */
    FMC_FLAG_OB0ECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 19U),                        /*!< an ECC bit error is detected in option byte 0 flag */
    FMC_FLAG_BK1ECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 20U),                        /*!< an ECC bit error is detected in bank 1 flag */
    FMC_FLAG_SYSECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 21U),                        /*!< an ECC bit error is detected in system memory flag */
    FMC_FLAG_DFECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 22U),                         /*!< an ECC bit error is detected in data flash flag */
    FMC_FLAG_OTPECC = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 23U),                        /*!< an ECC bit error is detected in OTP flag */
    FMC_FLAG_OB1ECCDET = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 26U),                     /*!< option bytes 1 two bit error detect flag */
    FMC_FLAG_OB0ECCDET = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 27U),                     /*!< option bytes 0 two bit error detect flag */
    FMC_FLAG_ECCCOR = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 30U),                        /*!< one bit error detected and correct flag */
    FMC_FLAG_ECCDET = FMC_REGIDX_BIT(FMC_ECCCS_REG_OFFSET, 31U),                        /*!< OTP/data flash/system memory/bank1 two bit error detect flag */
    /* flags in OBSTAT register */
    FMC_FLAG_OBERR = FMC_REGIDX_BIT(FMC_OBSTAT_REG_OFFSET, 0U),                         /*!< option bytes 0 error flag */
    /* flags in OB1CS register */
    FMC_FLAG_OB1ERR = FMC_REGIDX_BIT(FMC_OB1CS_REG_OFFSET, 0U)                          /*!< option bytes 1 read error flag */
} fmc_flag_enum;

