CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_fmc.h
/* option bytes software/hardware free watchdog timer */
#define OB_FWDGT_HW                  ((uint16_t)0x0100U)                                /*!< hardware free watchdog timer */
#define OB_FWDGT_SW                  ((uint16_t)0x0001U)                                /*!< software free watchdog timer */

/* option bytes reset or not entering deep sleep mode */
#define OB_DEEPSLEEP_RST             ((uint16_t)0x0200U)                                /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST            ((uint16_t)0x0002U)                                /*!< no reset when entering deepsleep mode */

/* option bytes reset or not entering standby mode */
#define OB_STDBY_RST                 ((uint16_t)0x0400U)                                /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                ((uint16_t)0x0004U)                                /*!< no reset when entering deepsleep mode */

/* option bytes boot from bank0 or bank1 when configured boot from main flash */
#define OB_BOOT_FROM_BANK1           ((uint16_t)0x0800U)                                /*!< boot from bank1 or bank0 if bank1 is void, when configured boot from main memory */
#define OB_BOOT_FROM_BANK0           ((uint16_t)0x0008U)                                /*!< boot from bank0, when configured boot from main memory */

/* option bytes OTA configuration */
#define OB_BOOT_OTA_ENABLE           ((uint16_t)0x1000U)                                /*!< when configured boot from main memory, if the BB is 0, all data will be copied from bank1 to bank0 and then boot from bank0 */
#define OB_BOOT_OTA_DISABLE          ((uint16_t)0x0010U)                                /*!< no effect */

/* option bytes brownout configuration */
#define OB_BOR_DISABLE               ((uint16_t)0x0080U)                                /*!< disable brown out */
#define OB_BOR_ENABLE                ((uint16_t)0x8000U)                                /*!< enable brown out, brownout threshold 2.6V */

/* option bytes 1 lock value in FMC_OB1CS register */
#define OB1CS_OB1_LKVAL(regval)      (BITS(16,31) & ((uint32_t)(regval) << 16))
#define OB1CS_OB1_LK                 OB1CS_OB1_LKVAL((uint16_t)0x33CCU)                 /*!< option byte1 cannot be modified */
#define OB1CS_OB1_NOT_LK             OB1CS_OB1_LKVAL((uint16_t)0x00FFU)                 /*!< option byte1 is not locked */

/* option bytes 1 extend flash block allocation in FMC_OB1CS register */
#define OB1CS_EFALC_EPSIZE(regval)   (BITS(4, 11) & ((uint32_t)(regval) << 4))
#define OB1CS_DF_INVALID             OB1CS_EFALC_EPSIZE((uint8_t)0xFFU)                 /*!< invalid configuration */
/* 384K flash or 256K flash */
#define OB1CS_DF_64K                 OB1CS_EFALC_EPSIZE((uint8_t)0xF0U)                 /*!< data flash size is 64KB */
/* 128K flash */
#define OB1CS_DF_32K                 OB1CS_EFALC_EPSIZE((uint8_t)0xF1U)                 /*!< data flash size is 32KB */
/* 64K flash */
#define OB1CS_DF_16K                 OB1CS_EFALC_EPSIZE((uint8_t)0xF2U)                 /*!< data flash size is 16KB */

#define BANK0_BASE_ADDRESS           ((uint32_t)0x08000000U)                            /*!< FMC bank0 base address */
#define BANK0_SIZE                   ((uint32_t)0x00040000U)                            /*!< FMC bank0 size */
#define BANK1_BASE_ADDRESS           ((uint32_t)(BANK0_BASE_ADDRESS + BANK0_SIZE))      /*!< FMC bank1 base address */
#define OB_WORD_CNT                  ((uint8_t)0x06U)                                   /*!< word count of option bytes */
#define OB_DOUBLEWORD_CNT            ((uint8_t)0x03U)                                   /*!< double-word count of option bytes */
#define FMC_TIMEOUT_COUNT            ((uint32_t)0x00FF0000U)                            /*!< count to judge of FMC timeout */
#define DOUBLEWORD_CNT_IN_ROW        ((uint8_t)0x20U)                                   /*!< double-word count in one row data */
#define CBCMDLEN_OF_ONE_ROW          ((uint8_t)0x05U)                                   /*!< CBCMD read length of one row data */

/* function declarations */
/* FMC programming functions */
/* unlock the main flash operation */
void fmc_unlock(void);
/* unlock the main flash bank0 operation */
void fmc_bank0_unlock(void);
/* unlock the main flash bank1 operation */
void fmc_bank1_unlock(void);
/* lock the main flash operation */
void fmc_lock(void);
/* lock the main flash bank0 operation */
void fmc_bank0_lock(void);
/* lock the main flash bank1 operation */
void fmc_bank1_lock(void);

/* set the wait state counter value */
void fmc_wscnt_set(uint8_t wscnt);
/* enable pre-fetch */
void fmc_prefetch_enable(void);
/* disable pre-fetch */
void fmc_prefetch_disable(void);
/* enable cache */
void fmc_cache_enable(void);
/* disable cache */
void fmc_cache_disable(void);
/* enable cache reset if cache is disabled */
void fmc_cache_reset_enable(void);
/* disable cache reset */
void fmc_cache_reset_disable(void);
/* flash goto power-down mode when MCU enters deepsleep mode */
void fmc_powerdown_mode_set(void);
/* flash goto sleep mode when MCU enters deepsleep mode */
void fmc_sleep_mode_set(void);
/* configure shared SRAM mode */
void fmc_sram_mode_config(fmc_sram_mode_enum sram_mode);
/* get shared SRAM mode */
fmc_sram_mode_enum fmc_sram_mode_get(void);

/* check whether flash page is blank or not by check blank command */
fmc_state_enum fmc_blank_check(uint32_t address, uint8_t length);
/* erase main flash page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* erase flash bank0 */
fmc_state_enum fmc_bank0_mass_erase(void);
/* erase flash bank1 */
fmc_state_enum fmc_bank1_mass_erase(void);
/* erase the data flash */
fmc_state_enum fmc_dflash_mass_erase(void);
/* erase whole chip */
fmc_state_enum fmc_mass_erase(void);

/* program a double word at the corresponding address in main flash */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* FMC fast program one row data (32 double-word) starting at the corresponding address */
fmc_state_enum fmc_fast_program(uint32_t address, uint64_t data[]);
/* program a double word at the corresponding address in OTP */
fmc_state_enum otp_doubleword_program(uint32_t address, uint64_t data);

/* FMC option bytes 0 functions */
/* unlock the option bytes 0 operation */
void ob_unlock(void);
/* lock the option bytes 0 operation */
void ob_lock(void);
/* force to reload the option bytes 0 */
void ob_reset(void);
/* erase the option bytes 0 */
fmc_state_enum ob_erase(void);
/* enable option bytes 0 write protection */
fmc_state_enum ob_write_protection_enable(fmc_area_enum wp_area, uint32_t ob_wp);
/* configure security protection */
fmc_state_enum ob_security_protection_config(uint16_t ob_spc);
/* program the FMC user option bytes 0 */
fmc_state_enum ob_user_write(uint16_t ob_user);
/* program the FMC data option bytes 0 */
fmc_state_enum ob_data_program(uint16_t ob_data);
/* get the value of FMC option bytes OB_USER in FMC_OBSTAT register */
uint8_t ob_user_get(void);
/* get the value of FMC option bytes OB_DATA in FMC_OBSTAT register */
uint16_t ob_data_get(void);
/* get the value of FMC option bytes BK0WP in FMC_WP0 register */
uint32_t ob_write_protection_get(void);
/* get the value of FMC option bytes BK1WP in FMC_WP1 register */
uint8_t ob_bk1_write_protection_get(void);
/* get the value of FMC option bytes DFWP in FMC_WP1 register */
uint8_t ob_df_write_protection_get(void);
/* get the value of FMC option bytes 0 security protection level (PLEVEL) in FMC_OBSTAT register */
uint8_t ob_plevel_get(void);

/* FMC option bytes 1 functions */
/* configure lock value in option bytes 1 */
fmc_state_enum ob1_lock_config(uint32_t lk_value);
/* configure option bytes 1 parameters */
fmc_state_enum ob1_parameter_config(uint32_t dflash_size);
/* get data flash size in byte unit */
uint32_t dflash_size_get(void);

/* interrupt & flag functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(fmc_flag_enum flag);
/* clear FMC flag status */
void fmc_flag_clear(fmc_flag_enum flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(fmc_interrupt_enum interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(fmc_interrupt_enum interrupt);
/* get FMC interrupt flag status */
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag);
/* clear FMC interrupt flag status */
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag);

#endif /* GD32A50X_FMC_H */
